app/views/project/show.html.erb

            <span id="average_rating"></span>
            <p> <span><%= @project.average_rating %> <%= @reviews.count %> <%= @reviews.count > 1 ? "Reviews" : "Review" %></span></p>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."project_id" = ?  [["project_id", 1]]