app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("project_id", "user_id", "comment", "created_at", "star", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["project_id", 1], ["user_id", 4], ["comment", "Very nice!"], ["created_at", "2018-08-20 14:00:12.573799"], ["star", 5], ["updated_at", "2018-08-20 14:00:12.573799"]]
---
  def create
    @review = Review.create(review_params)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
    @review = Review.find(params[:id])
    project = @review.project
    @review.destroy